# Задача: Мама пішла в супермаркет та побачила, що там є акція на парну кількість товарів в корзині.
# Завдання 4: Написати функцію, яка перевіряє чи число є парним. Цю функцію потрібно перевірити на числі, 
# яке вводиться з клавіатури, 
# якщо воно парне, то вивести повідомлення "Акція діє", якщо ні, то "Акція не діє"

# products = ["Фрукти", "Хліб", "Сир", "Масло"]
# if len(products)%2==0:
print("Введіть число")
val1 = float(input())
if val1%2==0:
    print("Акція діє")
else:
    print("Акція не діє")