# Дано рядок "established" . 
# Використовуючи зріс надрукувати на екран "lis"

str1 = "established"
print (str1[5:8])