# Дано рядок "established" . 
# Використовуючи зріс надрукувати на екран "establ"

str1 = "established"
print (str1[0:6])