# Дано рядок "established" . 
# Використовуючи зріс надрукувати на екран "hed"

str1 = "established"
print (str1[-3:])