# Створити масив arr=[5,0,-2,2,1,-6,4,-4,8,-10,55]. 
# 1. Надрукувати на екран тільки від`ємні числа ,
# 2. Надрукувати на екран тільки додатні числа .


# Наприклад [0,1,3,-2,-5,6,-4]
# Від`ємні числа ( <0):
# -2
# -5
# -4
# Додатні числа або 0 (>=0):
# 0
# 1
# 3
# 6

arr=[5,0,-2,2,1,-6,4,-4,8,-10,55]
arr_negative= []
arr_positive =[]
for i in range(len(arr)):
    if arr[i]<0:
        arr_negative.append(arr[i])
    else:
        arr_positive.append(arr[i])
print("Від`ємні числа масиву arr=[5,0,-2,2,1,-6,4,-4,8,-10,55]: ",arr_negative)
print("Додатні числа масиву arr=[5,0,-2,2,1,-6,4,-4,8,-10,55]: ",arr_positive) 



